vivmchp/hvac_pl10/firmware/config.mcc/src/packs/PIC32CM6408PL10032_DFP/component/pac.h
/*
 * Component description for PAC
 *
 * Copyright (c) 2026 Microchip Technology Inc. and its subsidiaries.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 */

/*      file generated from device description file (ATDF) version None       */
#ifndef _PIC32CMPL10_PAC_COMPONENT_H_
#define _PIC32CMPL10_PAC_COMPONENT_H_

#if !defined(DISABLE_CMSIS)
#include "core_cm0plus.h"
#endif /* !defined(DISABLE_CMSIS) */

/* ************************************************************************** */
/*                      SOFTWARE API DEFINITION FOR PAC                       */
/* ************************************************************************** */

/* -------- PAC_WRCTRL : (PAC Offset: 0x00) (R/W 32) Write Control -------- */
#define PAC_WRCTRL_RESETVALUE                 _UINT32_(0x00)                                       /*  (PAC_WRCTRL) Write Control  Reset Value */

#define PAC_WRCTRL_PERID_Pos                  _UINT32_(0)                                          /* (PAC_WRCTRL) Peripheral Identifier Position */
#define PAC_WRCTRL_PERID_Msk                  (_UINT32_(0xFFFF) << PAC_WRCTRL_PERID_Pos)           /* (PAC_WRCTRL) Peripheral Identifier Mask */
#define PAC_WRCTRL_PERID(value)               (PAC_WRCTRL_PERID_Msk & (_UINT32_(value) << PAC_WRCTRL_PERID_Pos)) /* Assignment of value for PERID in the PAC_WRCTRL register */
#define   PAC_WRCTRL_PERID_PAC_Val            _UINT32_(0x0)                                        /* (PAC_WRCTRL) APBA Peripheral  */
#define   PAC_WRCTRL_PERID_PM_Val             _UINT32_(0x1)                                        /* (PAC_WRCTRL) APBA Peripheral  */
#define   PAC_WRCTRL_PERID_MCLK_Val           _UINT32_(0x2)                                        /* (PAC_WRCTRL) APBA Peripheral  */
#define   PAC_WRCTRL_PERID_RSTC_Val           _UINT32_(0x3)                                        /* (PAC_WRCTRL) APBA Peripheral  */
#define   PAC_WRCTRL_PERID_OSCCTRL_Val        _UINT32_(0x4)                                        /* (PAC_WRCTRL) APBA Peripheral  */
#define   PAC_WRCTRL_PERID_OSC32KCTRL_Val     _UINT32_(0x5)                                        /* (PAC_WRCTRL) APBA Peripheral  */
#define   PAC_WRCTRL_PERID_SUPC_Val           _UINT32_(0x6)                                        /* (PAC_WRCTRL) APBA Peripheral  */
#define   PAC_WRCTRL_PERID_GCLK_Val           _UINT32_(0x7)                                        /* (PAC_WRCTRL) APBA Peripheral  */
#define   PAC_WRCTRL_PERID_WDT_Val            _UINT32_(0x8)                                        /* (PAC_WRCTRL) APBA Peripheral  */
#define   PAC_WRCTRL_PERID_RTC_Val            _UINT32_(0x9)                                        /* (PAC_WRCTRL) APBA Peripheral  */
#define   PAC_WRCTRL_PERID_EIC_Val            _UINT32_(0xA)                                        /* (PAC_WRCTRL) APBA Peripheral  */
#define   PAC_WRCTRL_PERID_PORT_Val           _UINT32_(0x20)                                       /* (PAC_WRCTRL) APBB Peripheral  */
#define   PAC_WRCTRL_PERID_DSU_Val            _UINT32_(0x21)                                       /* (PAC_WRCTRL) APBB Peripheral  */
#define   PAC_WRCTRL_PERID_NVMCTRL_Val        _UINT32_(0x22)                                       /* (PAC_WRCTRL) APBB Peripheral  */
#define   PAC_WRCTRL_PERID_DMAC_Val           _UINT32_(0x23)                                       /* (PAC_WRCTRL) APBB Peripheral  */
#define   PAC_WRCTRL_PERID_MTB_Val            _UINT32_(0x24)                                       /* (PAC_WRCTRL) APBB Peripheral  */
#define   PAC_WRCTRL_PERID_HMATRIXHS_Val      _UINT32_(0x25)                                       /* (PAC_WRCTRL) APBB Peripheral  */
#define   PAC_WRCTRL_PERID_EVSYS_Val          _UINT32_(0x40)                                       /* (PAC_WRCTRL) APBC Peripheral  */
#define   PAC_WRCTRL_PERID_SERCOM0_Val        _UINT32_(0x41)                                       /* (PAC_WRCTRL) APBC Peripheral  */
#define   PAC_WRCTRL_PERID_SERCOM1_Val        _UINT32_(0x42)                                       /* (PAC_WRCTRL) APBC Peripheral  */
#define   PAC_WRCTRL_PERID_TC0_Val            _UINT32_(0x43)                                       /* (PAC_WRCTRL) APBC Peripheral  */
#define   PAC_WRCTRL_PERID_TC1_Val            _UINT32_(0x44)                                       /* (PAC_WRCTRL) APBC Peripheral  */
#define   PAC_WRCTRL_PERID_TC2_Val            _UINT32_(0x45)                                       /* (PAC_WRCTRL) APBC Peripheral  */
#define   PAC_WRCTRL_PERID_TCC0_Val           _UINT32_(0x46)                                       /* (PAC_WRCTRL) APBC Peripheral  */
#define   PAC_WRCTRL_PERID_ADC0_Val           _UINT32_(0x47)                                       /* (PAC_WRCTRL) APBC Peripheral  */
#define   PAC_WRCTRL_PERID_AC_Val             _UINT32_(0x48)                                       /* (PAC_WRCTRL) APBC Peripheral  */
#define   PAC_WRCTRL_PERID_CCL_Val            _UINT32_(0x49)                                       /* (PAC_WRCTRL) APBC Peripheral  */
#define   PAC_WRCTRL_PERID_PTC_Val            _UINT32_(0x4A)                                       /* (PAC_WRCTRL) APBC Peripheral  */
#define   PAC_WRCTRL_PERID_SYSCTRL_Val        _UINT32_(0x4B)                                       /* (PAC_WRCTRL) APBC Peripheral  */
#define PAC_WRCTRL_PERID_PAC                  (PAC_WRCTRL_PERID_PAC_Val << PAC_WRCTRL_PERID_Pos)   /* (PAC_WRCTRL) APBA Peripheral Position */
#define PAC_WRCTRL_PERID_PM                   (PAC_WRCTRL_PERID_PM_Val << PAC_WRCTRL_PERID_Pos)    /* (PAC_WRCTRL) APBA Peripheral Position */
#define PAC_WRCTRL_PERID_MCLK                 (PAC_WRCTRL_PERID_MCLK_Val << PAC_WRCTRL_PERID_Pos)  /* (PAC_WRCTRL) APBA Peripheral Position */
#define PAC_WRCTRL_PERID_RSTC                 (PAC_WRCTRL_PERID_RSTC_Val << PAC_WRCTRL_PERID_Pos)  /* (PAC_WRCTRL) APBA Peripheral Position */
#define PAC_WRCTRL_PERID_OSCCTRL              (PAC_WRCTRL_PERID_OSCCTRL_Val << PAC_WRCTRL_PERID_Pos) /* (PAC_WRCTRL) APBA Peripheral Position */
#define PAC_WRCTRL_PERID_OSC32KCTRL           (PAC_WRCTRL_PERID_OSC32KCTRL_Val << PAC_WRCTRL_PERID_Pos) /* (PAC_WRCTRL) APBA Peripheral Position */
#define PAC_WRCTRL_PERID_SUPC                 (PAC_WRCTRL_PERID_SUPC_Val << PAC_WRCTRL_PERID_Pos)  /* (PAC_WRCTRL) APBA Peripheral Position */
#define PAC_WRCTRL_PERID_GCLK                 (PAC_WRCTRL_PERID_GCLK_Val << PAC_WRCTRL_PERID_Pos)  /* (PAC_WRCTRL) APBA Peripheral Position */
#define PAC_WRCTRL_PERID_WDT                  (PAC_WRCTRL_PERID_WDT_Val << PAC_WRCTRL_PERID_Pos)   /* (PAC_WRCTRL) APBA Peripheral Position */
#define PAC_WRCTRL_PERID_RTC                  (PAC_WRCTRL_PERID_RTC_Val << PAC_WRCTRL_PERID_Pos)   /* (PAC_WRCTRL) APBA Peripheral Position */
#define PAC_WRCTRL_PERID_EIC                  (PAC_WRCTRL_PERID_EIC_Val << PAC_WRCTRL_PERID_Pos)   /* (PAC_WRCTRL) APBA Peripheral Position */
#define PAC_WRCTRL_PERID_PORT                 (PAC_WRCTRL_PERID_PORT_Val << PAC_WRCTRL_PERID_Pos)  /* (PAC_WRCTRL) APBB Peripheral Position */
#define PAC_WRCTRL_PERID_DSU                  (PAC_WRCTRL_PERID_DSU_Val << PAC_WRCTRL_PERID_Pos)   /* (PAC_WRCTRL) APBB Peripheral Position */
#define PAC_WRCTRL_PERID_NVMCTRL              (PAC_WRCTRL_PERID_NVMCTRL_Val << PAC_WRCTRL_PERID_Pos) /* (PAC_WRCTRL) APBB Peripheral Position */
#define PAC_WRCTRL_PERID_DMAC                 (PAC_WRCTRL_PERID_DMAC_Val << PAC_WRCTRL_PERID_Pos)  /* (PAC_WRCTRL) APBB Peripheral Position */
#define PAC_WRCTRL_PERID_MTB                  (PAC_WRCTRL_PERID_MTB_Val << PAC_WRCTRL_PERID_Pos)   /* (PAC_WRCTRL) APBB Peripheral Position */
#define PAC_WRCTRL_PERID_HMATRIXHS            (PAC_WRCTRL_PERID_HMATRIXHS_Val << PAC_WRCTRL_PERID_Pos) /* (PAC_WRCTRL) APBB Peripheral Position */
#define PAC_WRCTRL_PERID_EVSYS                (PAC_WRCTRL_PERID_EVSYS_Val << PAC_WRCTRL_PERID_Pos) /* (PAC_WRCTRL) APBC Peripheral Position */
#define PAC_WRCTRL_PERID_SERCOM0              (PAC_WRCTRL_PERID_SERCOM0_Val << PAC_WRCTRL_PERID_Pos) /* (PAC_WRCTRL) APBC Peripheral Position */
#define PAC_WRCTRL_PERID_SERCOM1              (PAC_WRCTRL_PERID_SERCOM1_Val << PAC_WRCTRL_PERID_Pos) /* (PAC_WRCTRL) APBC Peripheral Position */
#define PAC_WRCTRL_PERID_TC0                  (PAC_WRCTRL_PERID_TC0_Val << PAC_WRCTRL_PERID_Pos)   /* (PAC_WRCTRL) APBC Peripheral Position */
#define PAC_WRCTRL_PERID_TC1                  (PAC_WRCTRL_PERID_TC1_Val << PAC_WRCTRL_PERID_Pos)   /* (PAC_WRCTRL) APBC Peripheral Position */
#define PAC_WRCTRL_PERID_TC2                  (PAC_WRCTRL_PERID_TC2_Val << PAC_WRCTRL_PERID_Pos)   /* (PAC_WRCTRL) APBC Peripheral Position */
#define PAC_WRCTRL_PERID_TCC0                 (PAC_WRCTRL_PERID_TCC0_Val << PAC_WRCTRL_PERID_Pos)  /* (PAC_WRCTRL) APBC Peripheral Position */
#define PAC_WRCTRL_PERID_ADC0                 (PAC_WRCTRL_PERID_ADC0_Val << PAC_WRCTRL_PERID_Pos)  /* (PAC_WRCTRL) APBC Peripheral Position */
#define PAC_WRCTRL_PERID_AC                   (PAC_WRCTRL_PERID_AC_Val << PAC_WRCTRL_PERID_Pos)    /* (PAC_WRCTRL) APBC Peripheral Position */
#define PAC_WRCTRL_PERID_CCL                  (PAC_WRCTRL_PERID_CCL_Val << PAC_WRCTRL_PERID_Pos)   /* (PAC_WRCTRL) APBC Peripheral Position */
#define PAC_WRCTRL_PERID_PTC                  (PAC_WRCTRL_PERID_PTC_Val << PAC_WRCTRL_PERID_Pos)   /* (PAC_WRCTRL) APBC Peripheral Position */
#define PAC_WRCTRL_PERID_SYSCTRL              (PAC_WRCTRL_PERID_SYSCTRL_Val << PAC_WRCTRL_PERID_Pos) /* (PAC_WRCTRL) APBC Peripheral Position */
#define PAC_WRCTRL_KEY_Pos                    _UINT32_(16)                                         /* (PAC_WRCTRL) Peripheral Access Control Key Position */
#define PAC_WRCTRL_KEY_Msk                    (_UINT32_(0xFF) << PAC_WRCTRL_KEY_Pos)               /* (PAC_WRCTRL) Peripheral Access Control Key Mask */
#define PAC_WRCTRL_KEY(value)                 (PAC_WRCTRL_KEY_Msk & (_UINT32_(value) << PAC_WRCTRL_KEY_Pos)) /* Assignment of value for KEY in the PAC_WRCTRL register */
#define   PAC_WRCTRL_KEY_OFF_Val              _UINT32_(0x0)                                        /* (PAC_WRCTRL) No action  */
#define   PAC_WRCTRL_KEY_CLR_Val              _UINT32_(0x1)                                        /* (PAC_WRCTRL) Clear the peripheral write-control  */
#define   PAC_WRCTRL_KEY_SET_Val              _UINT32_(0x2)                                        /* (PAC_WRCTRL) Set the peripheral write-control  */
#define   PAC_WRCTRL_KEY_SETLCK_Val           _UINT32_(0x3)                                        /* (PAC_WRCTRL) Set and lock the peripheral write-control until the next hardware reset  */
#define PAC_WRCTRL_KEY_OFF                    (PAC_WRCTRL_KEY_OFF_Val << PAC_WRCTRL_KEY_Pos)       /* (PAC_WRCTRL) No action Position */
#define PAC_WRCTRL_KEY_CLR                    (PAC_WRCTRL_KEY_CLR_Val << PAC_WRCTRL_KEY_Pos)       /* (PAC_WRCTRL) Clear the peripheral write-control Position */
#define PAC_WRCTRL_KEY_SET                    (PAC_WRCTRL_KEY_SET_Val << PAC_WRCTRL_KEY_Pos)       /* (PAC_WRCTRL) Set the peripheral write-control Position */
#define PAC_WRCTRL_KEY_SETLCK                 (PAC_WRCTRL_KEY_SETLCK_Val << PAC_WRCTRL_KEY_Pos)    /* (PAC_WRCTRL) Set and lock the peripheral write-control until the next hardware reset Position */
#define PAC_WRCTRL_Msk                        _UINT32_(0x00FFFFFF)                                 /* (PAC_WRCTRL) Register Mask  */


